(function(){
    let Valuing=Include("include/valuing.js")
    let Pro=function(){
        this.ID="pro"
    }
    var prefix={
        "万象":["青龙",25,1],
        "金藤":["青龙",32,2],
        "天罗":["青龙",39,3],
        "酥骨":["青龙",46,4],
        "青鲤":["青龙",53,5],
        "啸日":["青龙",60,6],
        "青阳":["青龙",67,7],
        "青圭":["青龙",74,8],
        "腾风":["青龙",81,9],
        "天眷":["青龙",88,10],
        "长乐":["青龙",95,11],
        "煮酒":["青龙",102,12],
        "卯文":["青龙",109,13],
        "噬魂":["青龙",116,14],
        "酒中仙":["青龙",123,15],
        "东乙青木":["青龙",130,16],
        "蔽日":["青龙",137,17],
        "孟章神君":["青龙",144,18],
        "摩利支天":["青龙",151,19],
        "青龙":["青龙",158,20],

        "天驱":["白虎",25,1],
        "虎皮":["白虎",32,2],
        "血牙":["白虎",39,3],
        "悲风":["白虎",46,4],
        "虎怒":["白虎",53,5],
        "虎贲":["白虎",60,6],
        "朱明":["白虎",67,7],
        "白琥":["白虎",74,8],
        "啸岳":["白虎",81,9],
        "寒岭":["白虎",88,10],
        "未央":["白虎",95,11],
        "陷阵":["白虎",102,12],
        "酉文":["白虎",109,13],
        "虎魄":["白虎",116,14],
        "兰陵王":["白虎",123,15],
        "西庚锐金":["白虎",130,16],
        "羊角":["白虎",137,17],
        "监兵神君":["白虎",144,18],
        "因陀罗	":["白虎",151,19],
        "白虎":["白虎",158,20],

        "铁血":["玄武",25,1],
        "玄铁":["玄武",32,2],
        "地煞":["玄武",39,3],
        "无锋":["玄武",46,4],
        "玄奕":["玄武",53,5],
        "玄蛇":["玄武",60,6],
        "严节":["玄武",67,7],
        "玄璜":["玄武",74,8],
        "镇海":["玄武",81,9],
        "玄沌":["玄武",88,10],
        "建章":["玄武",95,11],
        "无当":["玄武",102,12],
        "子文":["玄武",109,13],
        "太虚":["玄武",116,14],
        "万人敌":["玄武",123,15],
        "北水玄元":["玄武",130,16],
        "冥灵":["玄武",137,17],
        "执明神君":["玄武",144,18],
        "不动明王":["玄武",151,19],
        "玄武":["玄武",158,20],

        "影踪":["朱雀",25,1],
        "蚕丝":["朱雀",32,2],
        "凤舞":["朱雀",39,3],
        "荆棘":["朱雀",46,4],
        "朱邙":["朱雀",53,5],
        "朱璇":["朱雀",60,6],
        "素商":["朱雀",67,7],
        "赤璋":["朱雀",74,8],
        "浴火":["朱雀",81,9],
        "幻影":["朱雀",88,10],
        "阿房":["朱雀",95,11],
        "鹰视":["朱雀",102,12],
        "午文":["朱雀",109,13],
        "天诛":["朱雀",116,14],
        "易水寒":["朱雀",123,15],
        "南明离火":["朱雀",130,16],
        "扶摇":["朱雀",137,17],
        "陵光神君":["朱雀",144,18],
        "迦楼罗":["朱雀",151,19],
        "朱雀":["朱雀",158,20],
    }
    var suff={
        "盔":["帽子","防具"],
        "面具":["护面","防具"],
        "护腕":["护腕","防具"],
        "披风":["披风","防具"],
        "护手":["手套","防具"],
        "护肩":["护肩","防具"],
        "布甲":["铠甲","防具"],
        "板甲":["铠甲","防具"],
        "袍":["衣服","防具"],
        "腰带":["腰带","防具"],
        "盾":["盾牌","防具"],
        "腿甲":["护腿","防具"],
        "靴":["鞋子","防具"],
        "项链":["项链","饰品"],
        "戒指":["戒指","饰品"],
        "护心":["护心","饰品"],
    }
    Pro.prototype = Object.create(Valuing.prototype)
    Pro.prototype.Value=function(obj,asset){
        let data=SplitN(obj.Name,"之",2)
        if (data.length==2){
            let pro=prefix[data[0]]
            if (pro){
                asset.AddType("职业")
                asset.AddType(pro[0])
                asset.Level=pro[1]
                asset.Grade=pro[2]
                let atype=suff[data[1]]
                if (atype){
                    asset.AddTypes(atype)
                }
                asset.StoreType="rbz"
                asset.StoreType="rbz"
            }

        }
    }
    return Pro
})()