(function(){
    let Assessor=Include("include/assessor.js")
    let Pro=function(){
        this.ID="pro"
    }
    var prefix={
        "万象":["青龙",25],
        "金藤":["青龙",32],
        "天罗":["青龙",39],
        "酥骨":["青龙",46],
        "青鲤":["青龙",53],
        "啸日":["青龙",60],
        "青阳":["青龙",67],
        "青圭":["青龙",74],
        "腾风":["青龙",81],
        "天眷":["青龙",88],
        "长乐":["青龙",95],
        "煮酒":["青龙",102],
        "卯文":["青龙",109],
        "噬魂":["青龙",116],
        "酒中仙":["青龙",123],
        "东乙青木":["青龙",130],
        "蔽日":["青龙",137],
        "孟章神君":["青龙",144],
        "摩利支天":["青龙",151],
        "青龙":["青龙",158],

        "天驱":["白虎",25],
        "虎皮":["白虎",32],
        "血牙":["白虎",39],
        "悲风":["白虎",46],
        "虎怒":["白虎",53],
        "虎贲":["白虎",60],
        "朱明":["白虎",67],
        "白琥":["白虎",74],
        "啸岳":["白虎",81],
        "寒岭":["白虎",88],
        "未央":["白虎",95],
        "陷阵":["白虎",102],
        "酉文":["白虎",109],
        "虎魄":["白虎",116],
        "兰陵王":["白虎",123],
        "西庚锐金":["白虎",130],
        "羊角":["白虎",137],
        "监兵神君":["白虎",144],
        "因陀罗	":["白虎",151],
        "白虎":["白虎",158],

        "铁血":["玄武",25],
        "玄铁":["玄武",32],
        "地煞":["玄武",39],
        "无锋":["玄武",46],
        "玄奕":["玄武",53],
        "玄蛇":["玄武",60],
        "严节":["玄武",67],
        "玄璜":["玄武",74],
        "镇海":["玄武",81],
        "玄沌":["玄武",88],
        "建章":["玄武",95],
        "无当":["玄武",102],
        "子文":["玄武",109],
        "太虚":["玄武",116],
        "万人敌":["玄武",123],
        "北水玄元":["玄武",130],
        "冥灵":["玄武",137],
        "执明神君":["玄武",144],
        "不动明王":["玄武",151],
        "玄武":["玄武",158],

        "影踪":["朱雀",25],
        "蚕丝":["朱雀",32],
        "凤舞":["朱雀",39],
        "荆棘":["朱雀",46],
        "朱邙":["朱雀",53],
        "朱璇":["朱雀",60],
        "素商":["朱雀",67],
        "赤璋":["朱雀",74],
        "浴火":["朱雀",81],
        "幻影":["朱雀",88],
        "阿房":["朱雀",95],
        "鹰视":["朱雀",102],
        "午文":["朱雀",109],
        "天诛":["朱雀",116],
        "易水寒":["朱雀",123],
        "南明离火":["朱雀",130],
        "扶摇":["朱雀",137],
        "陵光神君":["朱雀",144],
        "迦楼罗":["朱雀",151],
        "朱雀":["朱雀",158],        
    }
    var suff={
        "盔":"帽子",
        "面具":"护面",
        "护腕":"护腕",
        "披风":"披风",
        "护手":"手套",
        "护肩":"护肩",
        "布甲":"铠甲",
        "袍":"衣服",
        "腰带":"腰带",
        "盾":"盾牌",
        "腿甲":"护腿",
        "靴":"鞋子",
        "项链":"项链",
        "戒指":"戒指",
        "护心":"护心",
    }
    Pro.prototype = Object.create(Assessor.prototype)
    Pro.prototype.Assess=function(obj,assessment){
        let data=SplitN(obj.Name,"之",2)
        if (data.length==2){
            let pro=prefix[data[0]]
            if (pro){
                assessment.Type.push("职业")
                assessment.Type.push("防具")
                assessment.Type.push(pro[0])
                assessment.Level=pro[1]
                let atype=suff[data[1]]
                if (atype){
                    assessment.Type.push(atype)
                }
            }

        }
    }
    return Pro
})()